In [351]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [352]:
#url = 'https://www.iplt20.com/auction/2022'
url = 'https://www.iplt20.com/auction/2021'
r = requests.get(url)
print(r.status_code) #To check the access

200

In [353]:
soup = BeautifulSoup(r.text,'lxml')
#print(soup)

In [354]:
table = soup.find("table",class_="ih-td-tab auction-tbl")
#print(table)

In [355]:
headers = table.find_all("th")
#print(headers)

In [356]:
for i in headers:
    print(i.text)

TEAM
FUNDS REMAINING
OVERSEAS PLAYERS
TOTAL PLAYERS

In [357]:
titles = []

for i in headers:
    title = i.text#.strip()
    titles.append(title)

print(titles)

['TEAM', 'FUNDS REMAINING', 'OVERSEAS PLAYERS ', 'TOTAL PLAYERS']

In [358]:
df = pd.DataFrame(columns = titles)
df

Empty DataFrame
Columns: [TEAM, FUNDS REMAINING, OVERSEAS PLAYERS , TOTAL PLAYERS]
Index: []

In [359]:
rows = table.find_all("tr")
#print(rows)

In [360]:
data_list = []

for i in rows[1:]:
    data = i.find_all('td')
   #print(data)
    row = [j.text for j in data]
    data_list.append(row)
    #print(row)
    #data_list.append(row)
    
for row in data_list:
    print(row)
#print(data_list)

['\n\n\n\n\nChennai Super Kings\n\n', '₹2,55,00,000', '8', '25']
['\n\n\n\n\nDelhi Capitals\n\n', '₹2,15,00,000', '8', '25']
['\n\n\n\n\nKolkata Knight Riders\n\n', '₹3,20,00,000', '8', '25']
['\n\n\n\n\nMumbai Indians\n\n', '₹3,65,00,000', '8', '25']
['\n\n\n\n\nPunjab Kings\n\n', '₹18,80,00,000', '8', '25']
['\n\n\n\n\nRajasthan Royals\n\n', '₹13,65,00,000', '8', '24']
['\n\n\n\n\nRoyal Challengers Bangalore\n\n', '₹35,00,000', '8', '22']
['\n\n\n\n\nSunrisers Hyderabad\n\n', '₹6,95,00,000', '8', '25']

In [361]:
data_list = []

for row in rows[1:]:
    row_data = []
    cells = row.find_all('td')
    for cell in cells:
        row_data.append(cell.text.strip())
    data_list.append(row_data)

# Print the extracted data
for row in data_list:
    print(row)

['Chennai Super Kings', '₹2,55,00,000', '8', '25']
['Delhi Capitals', '₹2,15,00,000', '8', '25']
['Kolkata Knight Riders', '₹3,20,00,000', '8', '25']
['Mumbai Indians', '₹3,65,00,000', '8', '25']
['Punjab Kings', '₹18,80,00,000', '8', '25']
['Rajasthan Royals', '₹13,65,00,000', '8', '24']
['Royal Challengers Bangalore', '₹35,00,000', '8', '22']
['Sunrisers Hyderabad', '₹6,95,00,000', '8', '25']

In [362]:
df = pd.DataFrame(data_list,columns= titles)
print(df)

                          TEAM FUNDS REMAINING OVERSEAS PLAYERS  TOTAL PLAYERS
0          Chennai Super Kings    ₹2,55,00,000                 8            25
1               Delhi Capitals    ₹2,15,00,000                 8            25
2        Kolkata Knight Riders    ₹3,20,00,000                 8            25
3               Mumbai Indians    ₹3,65,00,000                 8            25
4                 Punjab Kings   ₹18,80,00,000                 8            25
5             Rajasthan Royals   ₹13,65,00,000                 8            24
6  Royal Challengers Bangalore      ₹35,00,000                 8            22
7          Sunrisers Hyderabad    ₹6,95,00,000                 8            25

In [363]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')
df.head()

                    team funds_remaining overseas_players_ total_players
0    Chennai Super Kings    ₹2,55,00,000                 8            25
1         Delhi Capitals    ₹2,15,00,000                 8            25
2  Kolkata Knight Riders    ₹3,20,00,000                 8            25
3         Mumbai Indians    ₹3,65,00,000                 8            25
4           Punjab Kings   ₹18,80,00,000                 8            25

In [364]:
df.funds_remaining = df.funds_remaining.str.replace('₹','')
df.head()

                    team funds_remaining overseas_players_ total_players
0    Chennai Super Kings     2,55,00,000                 8            25
1         Delhi Capitals     2,15,00,000                 8            25
2  Kolkata Knight Riders     3,20,00,000                 8            25
3         Mumbai Indians     3,65,00,000                 8            25
4           Punjab Kings    18,80,00,000                 8            25

In [365]:
# df.to_csv("C:/Users/HP/Documents/Prepinsta/Week 5/Practice/Yotube_Web_Scapping/Tata IPL Auction.csv")

In [366]:
# Initialize an empty list to hold rows
rows_data = []

# Iterate over each row
for i in rows[1:]:
    data = i.find_all("td")
    row = [j.text for j in data]
    rows_data.append(row)

# Create DataFrame from the list of rows
try:
    df = pd.DataFrame(rows_data,columns = titles)
except Exception as e:
    print("Error occurred while creating DataFrame:", e)

#print(df)
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')
df.head()

,team,funds_remaining,overseas_players_,total_players
0,\n\n\n\n\nChennai Super Kings\n\n,"₹2,55,00,000",8,25
1,\n\n\n\n\nDelhi Capitals\n\n,"₹2,15,00,000",8,25
2,\n\n\n\n\nKolkata Knight Riders\n\n,"₹3,20,00,000",8,25
3,\n\n\n\n\nMumbai Indians\n\n,"₹3,65,00,000",8,25
4,\n\n\n\n\nPunjab Kings\n\n,"₹18,80,00,000",8,25

In [367]:
df.team = df.team.str.replace('\n','')
df.head()

                    team funds_remaining overseas_players_ total_players
0    Chennai Super Kings    ₹2,55,00,000                 8            25
1         Delhi Capitals    ₹2,15,00,000                 8            25
2  Kolkata Knight Riders    ₹3,20,00,000                 8            25
3         Mumbai Indians    ₹3,65,00,000                 8            25
4           Punjab Kings   ₹18,80,00,000                 8            25